Revit 2027 API
RevitLinkOptions Methods
The RevitLinkOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetWorksetConfiguration |  Gets the set of worksets to open when creating the link.
SetWorksetConfiguration |  Sets the set of worksets to open when creating the link.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RevitLinkOptions Class
Autodesk.Revit.DB Namespace